[{
  "_id": {
    "$oid": "6581b95502380d16087ec474"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "TO KILL A MOCKINGBIRD",
  "author": " Harper Lee",
  "genre": "Fiction",
  "year": 2010,
  "description": "'Shoot all the bluejays you want, if you can hit 'em, but remember it's a sin to kill a mockingbird.'\n\nA lawyer's advice to his children as he defends the real mockingbird of Harper Lee's classic novel - a black man falsely charged with the rape of a white girl. Through the young eyes of Scout and Jem Finch, Harper Lee explores with exuberant humour the irrationality of adult attitudes to race and class in the Deep South of the 1930s.\n\nThe conscience of a town steeped in prejudice, violence and hypocrisy is pricked by the stamina of one man's struggle for justice. But the weight of history will only tolerate so much.\n________________________________\nTo Kill a Mockingbird is a coming-of-age story, an anti-racist novel, a historical drama of the Great Depression and a sublime example of the Southern writing tradition.",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81gepf1eMqL._SY466_.jpg",
  "isbn": "0099549484",
  "pagesCount": 320,
  "price": 245,
  "creationDate": {
    "$date": "2023-12-19T15:40:05.843Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581b9c402380d16087ec479"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Wuthering Heights",
  "author": " Emily Brontë ",
  "genre": "Fiction",
  "year": 2013,
  "description": "Immerse yourself in the tempestuous world of Wuthering Heights by Emily Bronte. This hauntingly beautiful novel unravels a tale of forbidden love, revenge, and tumultuous emotions as captivating characters navigate the wild moors of 19th-century Yorkshire.\n\nA tale of passion and dark romance!\n\nEmily Bronte's iconic and haunting masterpiece\nGripping story of passionate love and bitter vendettas\nAtmospheric setting on the desolate Yorkshire moors\nComplex and deeply flawed characters that leave a lasting impact\nA timeless exploration of the destructive power of obsession and desire",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/71IobR8EclL._SY466_.jpg",
  "isbn": "8172344899",
  "pagesCount": 376,
  "price": 99,
  "creationDate": {
    "$date": "2023-12-19T15:41:56.820Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581ba6602380d16087ec484"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Kafka On The Shore",
  "author": "Haruki Murakami ",
  "genre": "Fiction",
  "year": 2005,
  "description": "Kafka Tamura runs away from home at fifteen, under the shadow of his father's dark prophesy.\n\nThe aging Nakata, tracker of lost cats, who never recovered from a bizarre childhood affliction, finds his pleasantly simplified life suddenly turned upside down.\n\nAs their parallel odysseys unravel, cats converse with people; fish tumble from the sky; a ghost-like pimp deploys a Hegel-spouting girl of the night; a forest harbours soldiers apparently un-aged since World War II. There is a savage killing, but the identity of both victim and killer is a riddle - one of many which combine to create an elegant and dreamlike masterpiece.",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81tdbrewW0L._SY466_.jpg",
  "isbn": "9780099458326",
  "pagesCount": 512,
  "price": 380,
  "creationDate": {
    "$date": "2023-12-19T15:44:38.965Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581bacd02380d16087ec489"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Night Circus",
  "author": " Erin Morgenstern ",
  "genre": "Fiction",
  "year": 2012,
  "description": "The circus arrives without warning. It is simply there, when yesterday it was not.\n\nAgainst the grey sky the towering tents are striped black and white. A sign hanging upon an iron gates reads:\n\nOpens at Nightfall\nCloses at Dawn\n\nFull of breath-taking amazements and open only at night, Le Cirque des Rêves seems to cast a spell over all who wander its circular paths. But behind the glittering acrobats, fortune-tellers and contortionists a fierce competition is underway.\n\nCelia and Marco are two young magicians who have been trained since childhood for a deadly duel. With the lives of everyone at the Circus of Dreams at stake, they must test the very limits of the imagination, and of their love.\n\nComplete your collection with The Starless Sea, the second novel from the author of the The Night Circus, out now.\n\n'The only response to this novel is simply: wow. It is a breath-taking feat of imagination, a flight of fancy that pulls you in and wraps you up in its spell' The Times",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/815D5sneiNL._SY466_.jpg",
  "isbn": "9780099570295",
  "pagesCount": 512,
  "price": 358,
  "creationDate": {
    "$date": "2023-12-19T15:46:21.385Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581bb3302380d16087ec48e"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "1Q84: Books 1, 2 and 3",
  "author": " Haruki Murakami ",
  "genre": "Fiction",
  "year": 2012,
  "description": "The year is 1Q84. This is the real world, there is no doubt about that. But in this world, there are two moons in the sky.\n\nIn this world, the fates of two people, Tengo and Aomame, are closely intertwined. They are each, in their own way, doing something very dangerous. And in this world, there seems no way to save them both.\n\nSomething extraordinary is starting.\n\n'1Q84 has a range and sophistication that surpasses anything else in his oeuvre.' Independent on Sunday\n\n‘Murakami's magnum opus’ Japan Times\n\n‘Vibrating with wit, intellect and ambition’ The Times",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81WaPTDslGL._SY466_.jpg",
  "isbn": "0099578077",
  "pagesCount": 1328,
  "price": 540,
  "creationDate": {
    "$date": "2023-12-19T15:48:03.979Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581bb8a02380d16087ec493"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Norwegian Wood",
  "author": " Haruki Murakami",
  "genre": "Fiction",
  "year": 2001,
  "description": "Read the haunting love story that turned Murakami into a literary superstar. When he hears her favourite Beatles song, Toru Watanabe recalls his first love Naoko, the girlfriend of his best friend Kizuki. Immediately he is transported back almost twenty years to his student days in Tokyo, adrift in a world of uneasy friendships, casual sex, passion, loss and desire - to a time when an impetuous young woman called Midori marches into his life and he has to choose between the future and the past. 'Evocative, entertaining, sexy and funny; but then Murakami is one of the best writers around' Time Out 'Such is the exquisite, gossamer construction of Murakami's writing that everything he chooses to describe trembles with symbolic possibility' Guardian 'This book is undeniably hip, full of student uprisings, free love, booze and 1960s pop, it's also genuinely emotionally engaging, and describes the highs of adolescence as well as the lows' Independent on Sunday",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81zqVhvbHbL._SY466_.jpg",
  "isbn": "9780099448822",
  "pagesCount": 400,
  "price": 298,
  "creationDate": {
    "$date": "2023-12-19T15:49:30.049Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581bbe902380d16087ec498"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Pachinko",
  "author": " Min Jin Lee",
  "genre": "Fiction",
  "year": 2022,
  "description": "'This is a captivating book... Min Jin Lee's novel takes us through four generations and each character's search for identity and success. It's a powerful story about resilience and compassion' BARACK OBAMA.\n\nYeongdo, Korea 1911. In a small fishing village on the banks of the East Sea, a club-footed, cleft-lipped man marries a fifteen-year-old girl. The couple have one child, their beloved daughter Sunja. When Sunja falls pregnant by a married yakuza, the family face ruin. But then Isak, a Christian minister, offers her a chance of salvation: a new life in Japan as his wife.\n\nFollowing a man she barely knows to a hostile country in which she has no friends, no home, and whose language she cannot speak, Sunja's salvation is just the beginning of her story.\n\nThrough eight decades and four generations, Pachinko is an epic tale of family, identity, love, death and survival.",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81UxgyI55BL._SY466_.jpg",
  "isbn": "1838930507",
  "pagesCount": 560,
  "price": 437,
  "creationDate": {
    "$date": "2023-12-19T15:51:05.834Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581bc4d02380d16087ec49d"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "A Game of Thrones",
  "author": " George R.R. Martin",
  "genre": "Fiction",
  "year": 2011,
  "description": "HBO’s hit series A GAME OF THRONES is based on George R R Martin’s internationally bestselling series A SONG OF ICE AND FIRE, the greatest fantasy epic of the modern age. A GAME OF THRONES is the first volume in the series.‘So vivid that you’ll be hooked within a few pages’ The TimesSummers span decades. Winter can last a lifetime. And the struggle for the Iron Throne has begun.As Warden of the north, Lord Eddard Stark counts it a curse when King Robert bestows on him the office of the Hand. His honour weighs him down at court where a true man does what he will, not what he must … and a dead enemy is a thing of beauty.The old gods have no power in the south, Stark’s family is split and there is treachery at court. Worse, the vengeance-mad heir of the deposed Dragon King has grown to maturity in exile in the Free Cities. He claims the Iron Throne.",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/51ffB22hWxL._SY445_SX342_.jpg",
  "isbn": "9780007448036",
  "pagesCount": 816,
  "price": 494,
  "creationDate": {
    "$date": "2023-12-19T15:52:45.645Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581bd5802380d16087ec4a3"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "City of Girls",
  "author": " Elizabeth Gilbert",
  "genre": "Fiction",
  "year": 2019,
  "description": "It is the summer of 1940. Nineteen-year-old Vivian Morris arrives in New York with her suitcase and sewing machine, exiled by her despairing parents. Although her quicksilver talents with a needle and commitment to mastering the perfect hair roll have been deemed insufficient for her to pass into her sophomore year of Vassar, she soon finds gainful employment as the self-appointed seamstress at the Lily Playhouse, her unconventional Aunt Peg's charmingly disreputable Manhattan revue theatre. There, Vivian quickly becomes the toast of the showgirls, transforming the trash and tinsel only fit for the cheap seats into creations for goddesses. Exile in New York is no exile at all: here in this strange wartime city of girls, Vivian and her girlfriends mean to drink the heady highball of life itself to the last drop. And when the legendary English actress Edna Watson comes to the Lily to star in the company's most ambitious show ever, Vivian is entranced by the magic that follows in her wake. But there are hard lessons to be learned, and bitterly regrettable mistakes to be made. Vivian learns that to live the life she wants, she must live many lives, ceaselessly and ingeniously making them new.'At some point in a woman's life, she just gets tired of being ashamed all the time. After that, she is free to become whoever she truly is,' she confides. And so Vivian sets forth her story, and that of the women around her - women who have lived as they truly are, out of step with a century that could never quite keep up with them.",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81VXEqsuoXL._SY466_.jpg",
  "isbn": "1526615231",
  "pagesCount": 480,
  "price": 350,
  "creationDate": {
    "$date": "2023-12-19T15:57:12.250Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581c0ee02380d16087ec4ad"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Slaughterhouse 5",
  "author": " Kurt Vonnegut",
  "genre": "Fiction",
  "year": 1991,
  "description": "Billy Pilgrim - hapless barber's assistant, successful optometrist, alien abductee, senile widower and soldier - has become unstuck in time.\n\n'An extraordinary success. A book to read and reread. He is a true artist' New York Times Book Review\n\nHiding in the basement of a slaughterhouse in Dresden, with the city and its inhabitants burning above him, Billy finds himself a survivor of one of the most deadly and destructive battles of the Second World War. But when, exactly? How did he get here? And how does he get out?\nTravel through time and space on the shoulders of Vonnegut himself. This is a book about war. Listen to what he has to say: it is of the utmost urgency.\n\n'The great, urgent, passionate American writer of our century, who offers us a model of the kind of compassionate thinking that might yet save us from ourselves.' George Saunders, author of Lincoln in the Bardo",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81H8EJBf9hL._SY466_.jpg",
  "isbn": "0099800209",
  "pagesCount": 192,
  "price": 418,
  "creationDate": {
    "$date": "2023-12-19T16:12:30.442Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581c26a02380d16087ec4b2"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Beloved",
  "author": " Toni Morrison",
  "genre": "Fiction",
  "year": 1999,
  "description": "'An American masterpiece' AS Byatt\n\nWITH A NEW INTRODUCTION BY BOOKER PRIZE WINNER BERNARDINE EVARISTO\n\nSethe is now miles away from Sweet Home - the farm where she was kept as a slave for many years. Unable to forget the unspeakable horrors that took place there, Sethe is haunted by the violent spectre of her dead child, the daughter who died nameless and whose tombstone is etched with a single word, 'Beloved'.\n\nA tale of brutality, horror and, above all, love at any cost, Beloved is Toni Morrison's enduring masterpiece and best-known work.\n\nStunningly-designed new editions of Toni Morrison's best-known novels, published by Vintage Classics in celebration of her life and work.\n\n'The literary titian we must never stop learning from' Metro\nWinner of the PEN/Saul Bellow award for achievement in American fiction",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/71qZg5ZEhpL._SY466_.jpg",
  "isbn": "0099273934",
  "pagesCount": 352,
  "price": 357,
  "creationDate": {
    "$date": "2023-12-19T16:18:50.538Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581c2bb02380d16087ec4b7"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "An Ember In The Ashes",
  "author": " Sabaa Tahir",
  "genre": "Fiction",
  "year": 2018,
  "description": "Keeps one reading long after the lights should have been out  Robin HobbRead the explosive New York Times bestselling debut thats captivated readers worldwide. Set to be a major motion picture, An Ember in the Ashes is the book everyone is talking about.Under the Martial Empire, defiance is met with death.When Laias grandparents are brutally murdered and her brother arrested for treason by the empire, the only people she has left to turn to are the rebels.But in exchange for their help in saving her brother, they demand that Laia spy on the ruthless Commandant of Blackcliff, the Empires greatest military academy. Should she fail its more than her brothers freedom at risk . . . Laias very life is at stake.There, she meets Elias, the academys finest soldier. But Elias wants only to be free of the tyranny hes being trained to enforce. He and Laia will soon realize that their destinies are intertwined  and that their choices will change the fate of the Empire itself.",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/8130cZxl2hL._SY466_.jpg",
  "isbn": "0008108420",
  "pagesCount": 464,
  "price": 357,
  "creationDate": {
    "$date": "2023-12-19T16:20:11.059Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581c30502380d16087ec4bc"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Origin",
  "author": " Dan Brown",
  "genre": "Fiction",
  "year": 2017,
  "description": "The spellbinding new Robert Langdon novel from the author of The Da Vinci Code.\n\nRobert Langdon, Harvard professor of symbology and religious iconology, arrives at the Guggenheim Museum Bilbao to attend the unveiling of a discovery that \"will change the face of science forever\". The evening's host is his friend and former student, Edmond Kirsch, a forty-year-old tech magnate whose dazzling inventions and audacious predictions have made him a controversial figure around the world. This evening is to be no exception: he claims he will reveal an astonishing scientific breakthrough to challenge the fundamentals of human existence.\n\nBut Langdon and several hundred other guests are left reeling when the meticulously orchestrated evening is blown apart before Kirsch's precious discovery can be revealed. With his life under threat, Langdon is forced into a desperate bid to escape, along with the museum's director, Ambra Vidal. Together they flee to Barcelona on a perilous quest to locate a cryptic password that will unlock Kirsch's secret.",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/91ZeWa2jVaL._SY466_.jpg",
  "isbn": "0593078756",
  "pagesCount": 544,
  "price": 500,
  "creationDate": {
    "$date": "2023-12-19T16:21:25.881Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581c41f02380d16087ec4c1"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Black Leopard, Red Wolf",
  "author": "Marlon James",
  "genre": "Fiction",
  "year": 2019,
  "description": "'Black Leopard, Red Wolf is the kind of novel I never realized I was missing until I read it. A dangerous, hallucinatory, ancient Africa, which becomes a fantasy world as well-realized as anything Tolkien made, with language as powerful as Angela Carter's. I cannot wait for the next installment' Neil GaimanIn this stunning follow-up to his Man Booker-winning A Brief History of Seven Killings, Marlon James draws on a rich tradition of African mythology, fantasy and history to imagine an ancient world, a lost child, an extraordinary hunter, and a mystery with many answers...'The child is dead. There is nothing left to know.'Tracker is a hunter, known throughout the thirteen kingdoms as one who has a nose - and he always works alone. But he breaks his own rule when, hired to find a lost child, he finds himself part of a group of hunters all searching for the same boy. Each of these companions is stranger and more dangerous than the last, from a giant to a witch to a shape-shifting Leopard, and each has secrets of their own.As the mismatched gang follow the boy's scent from perfumed citadels to infested rivers to the enchanted darklands and beyond, set upon at every turn by creatures intent on destroying them, Tracker starts to wonder: who really is this mysterious boy?",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/A1pVEPW55OL._SY466_.jpg",
  "isbn": "0241315581",
  "pagesCount": 640,
  "price": 478,
  "creationDate": {
    "$date": "2023-12-19T16:26:07.806Z"
  },
  "__v": 0
}]