[{
  "_id": {
    "$oid": "6581cb5f02380d16087ec531"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "WISH I COULD TELL YOU",
  "author": " Durjoy Datta",
  "genre": "Romance",
  "year": 2019,
  "description": "Can you find yourself after you have lost that special someone?\nA disillusioned and heartbroken Anusha finds herself in the small world of WeDonate.com. Struggling to cope with her feelings and the job of raising money for charity, she reluctantly searches for a worthwhile cause to support.\nFor Ananth, who has been on the opposite side, no life is less worthy, no cause too small to support.\nBehind them are teams for whom going to extraordinary lengths to save lives is more than a full-time occupation. In front of them is the virtual world of social media-watching, interacting, judging, making choices, and sometimes, saving lives.\nFrom the virtual to the real, their lives and that of their families, entangle in a way that moving together is the only solution. They can't escape each other.\nIn this world of complicated relationships, should love be such a difficult ride?",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/91R5TW7tdzL._SY466_.jpg",
  "isbn": "0143448331",
  "pagesCount": 288,
  "price": 156,
  "creationDate": {
    "$date": "2023-12-19T16:57:03.584Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581cbdd02380d16087ec536"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "ME BEFORE YOU",
  "author": " Jojo Moyes",
  "genre": "Romance",
  "year": 2012,
  "description": "Lou Clark know how many steps from the bus stop to her house. She knows that she really likes working in cafes and that, most likely, she does not love her boyfriend Patrick. But Lou doesn't know what's going to lose his job and that in the near future she will need all the strength to overcome the problems piled on her.\nWill Traynor knows what hit him, the motorcyclist took away his desire to live. And he knows exactly what needs to be done to put an end to all this. But he doesn't know that Lou will soon burst into his world in a riot of colors. And they both don't know that will forever change the lives of each other.",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/71+YK9HSaJL._SY466_.jpg",
  "isbn": "0718157834",
  "pagesCount": 528,
  "price": 300,
  "creationDate": {
    "$date": "2023-12-19T16:59:09.918Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581cc3d02380d16087ec53b"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "THE CUCKOO'S CALLING",
  "author": " Robert Galbraith ",
  "genre": "Romance",
  "year": 2014,
  "description": "The Cuckoo's Calling reminds me why I fell in love with crime fiction in the first place' VAL MCDERMID-----Now a major BBC drama: The Strike seriesWhen a troubled model falls to her death from a snow-covered Mayfair balcony, it is assumed that she has committed suicide. However, her brother has his doubts, and calls in private investigator Cormoran Strike to look into the case. Strike is a war veteran - wounded both physically and psychologically - and his life is in disarray. The case gives him a financial lifeline, but it comes at a personal cost: the more he delves into the young model's complex world, the darker things get - and the closer he gets to terrible danger . . . A gripping, elegant mystery steeped in the atmosphere of London - from the hushed streets of Mayfair to the backstreet pubs of the East End to the bustle of Soho - The Cuckoo's Calling is a remarkable book. Introducing Cormoran Strike, this is the acclaimed first crime novel by J. K. Rowling, writing under the pseudonym Robert Galbraith. *** The latest book in the thrilling Strike series, TROUBLED BLOOD, is out now! ***-----PRAISE FOR THE STRIKE SERIES: 'One of the most unique and compelling detectives I've come across in years' MARK BILLINGHAM'The work of a master storyteller' DAILY TELEGRAPH'Unputdownable. . . Irresistible' SUNDAY TIMES'Will keep you up all night' OBSERVER'A thoroughly enjoyable classic' PETER JAMES, SUNDAY EXPRESS",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81tTQKv-P7L._SY466_.jpg",
  "isbn": "0751549258",
  "pagesCount": 560,
  "price": 349,
  "creationDate": {
    "$date": "2023-12-19T17:00:45.149Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581cca502380d16087ec540"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "The Friend Zone",
  "author": " Abby Jimenez",
  "genre": "Romance",
  "year": 2019,
  "description": "Kristen Petersen is perfectly fine. She has friends she'd fight to the death for and the very best dog in the world: Stuntman Mike. In fact, everything's calm in the world of Kristen, until she starts to plan her best friend's wedding and meets the best man, Josh Copeland.\n\nJosh is funny, sexy, stands up to her sarcasm, and is always one snack ahead of her hangry. Even Stuntman Mike adores him. But he wants a big family, and Kristen knows children are probably not a part of her future.\n\nShe's sure he'd be better off with someone else, someone who can give him everything he wants, so Kristen keeps him at arm's length: in the Friend Zone. But as their attraction grows, it's harder and harder to resist falling for the man who seems to be everything she's not allowed to have . . .",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/711QH656UfL._SY466_.jpg",
  "isbn": "0349423407",
  "pagesCount": 384,
  "price": 899,
  "creationDate": {
    "$date": "2023-12-19T17:02:29.963Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581cd5402380d16087ec54b"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "See Her Die",
  "author": " Melinda Leigh",
  "genre": "Romance",
  "year": 2020,
  "description": "Sheriff Bree Taggert is both hunter and hunted in #1 Amazon Charts and Wall Street Journal bestselling author Melinda Leigh’s blood-freezing thriller of murder, rage, and revenge. New sheriff Bree Taggert is called to a shooting in a campground shuttered for the winter. But she arrives to find a perplexing crime. There is no shooter, no victim, and no blood. No one but Bree believes the sole witness, Alyssa, a homeless teenager who insists she saw her friend shot. Bree calls in former deputy Matt Flynn and his K-9 to track the killer and search for Alyssa’s friend. They discover the battered corpse of a missing university student under the ice in Grey Lake―but it’s not the victim they were looking for. When two more students go missing and additional bodies turn up, Bree must find the link between the victims. She knows only one thing for certain: the murders are fueled by rage. When Alyssa disappears, Bree must race against time to find her before her witness becomes another victim",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81vS6l8v60L._SY466_.jpg",
  "isbn": "1542006961",
  "pagesCount": 320,
  "price": 800,
  "creationDate": {
    "$date": "2023-12-19T17:05:24.770Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581d24402380d16087ec554"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Life After Life",
  "author": " Kate Atkinson",
  "genre": "Romance",
  "year": 2014,
  "description": "'Dazzling, witty, moving, joyful, mournful, profound. Wildly inventive, deeply felt. Hilarious. Humane. Simply put: it's one of the best novels I've read this century' Gillian Flynn, bestselling author of GONE GIRL'A box of delights. Ingenious in construction, indefatigably entertaining, it grips the reader's imagination on the first page and never lets go.' HILARY MANTEL, author of THE MIRROR AND THE LIGHTWhat if you had the chance to live your life again and again, until you finally got it right?During a snowstorm in England in 1910, a baby is born and dies before she can take her first breath.During a snowstorm in England in 1910, the same baby is born and lives to tell the tale.What if there were second chances? And third chances? In fact an infinite number of chances to live your life? Would you eventually be able to save the world from its own inevitable destiny? And would you even want to?Life After Life follows Ursula Todd as she lives through the turbulent events of the last century again and again. ",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/71q6y0hWveS._SY466_.jpg",
  "isbn": "9780552776639",
  "pagesCount": 624,
  "price": 318,
  "creationDate": {
    "$date": "2023-12-19T17:26:28.227Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581d29802380d16087ec559"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "THE LONGEST RIDE",
  "author": " Nicholas Sparks ",
  "genre": "Romance",
  "year": 2013,
  "description": "Ninety-one year old Ira Levinson is in trouble. Struggling to stay conscious after a car crash, with his mind fading, an image of his beloved, and long-dead, wife Ruth appears. Urging him to hang on, she lovingly recounts the joys and sorrows of their life together - how they met, the dark days of WWII, and its unrelenting effect on their families.A few miles away, college student Sophia Danko's life is about to change. Recovering from a break-up, she meets the young, rugged Luke and is thrown into a world far removed from her privileged school life. Sophia sees a new and tantalising future for herself, but Luke has a secret which threatens it all.Ira and Ruth. Sophia and Luke. Two couples, separated by years and experience, whose lives are about to converge in the most unexpected - and shocking - of ways.The new epic love story from the multi-million-copy bestselling author of The Notebook, The Lucky One and The Best of Me. Nicholas Sparks is one of the world's most beloved authors.",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81+Ae7W7DfL._SY466_.jpg",
  "isbn": "9780751549973",
  "pagesCount": 480,
  "price": 245,
  "creationDate": {
    "$date": "2023-12-19T17:27:52.705Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581d33b02380d16087ec55e"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "The Lucky One",
  "author": " Nicholas Sparks ",
  "genre": "Romance",
  "year": 2012,
  "description": "Do you believe in lucky charms?\n\nWhile in Iraq, U.S. Marine Logan Thibault finds a photo, half-buried in the dirt, of a woman. He carries it in his pocket, and from then on his luck begins to change.\n\nBack home, Logan is haunted by thoughts of war. Over time, he becomes convinced that the woman in the photo holds the key to his destiny. So he finds the vulnerable and loving Beth and a passionate romance begins.\n\nBut Logan battles with the one secret he has kept from Beth: how he found her in the first place. And it is a secret that could utterly destroy everything they love . . .",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81THiUMrYvL._SY466_.jpg",
  "isbn": "1455508969",
  "pagesCount": 368,
  "price": 250,
  "creationDate": {
    "$date": "2023-12-19T17:30:35.215Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6581d3a202380d16087ec563"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Duke Effect",
  "author": " Sophie Jordan ",
  "genre": "Romance",
  "year": 2020,
  "description": "New York Times and USA Today bestselling author Sophie Jordan continues her bestselling Rogue Files series with this captivating romance that will thrill her many fans.She doesn’t care about love…Despite being surrounded by her happily wed sisters, Nora Langley prefers botany to ballrooms and would rather spend a lifetime in her laboratory than consider affairs of the heart. An expert herbalist, Nora has been masquerading as her late physician father for years, dispensing invaluable medical advice. She corresponds with people all over the world, including an old army colonel. But when the man shows up on her doorstep, he is nothing like she expected—he is a young, handsome heir to a dukedom who suddenly threatens everything she holds dear.He only cares about duty…Constantine Sinclair arrives on the Langley doorstep in a desperate bid to save the woman who raised him, the Duchess of Birchwood … only to discover that the venerable doctor he expected is a bold and lovely charlatan. Furious at the deception, he vows to reveal her secrets. Determined to prove her skills, Nora promises to save the duchess in exchange for Con keeping her secret. Con reluctantly agrees… and soon Nora’s brilliant, headstrong ways are throwing his carefully controlled life into chaos. What happens when the rigid soldier begins to lose his grip on his heart?",
  "cover": "https://m.media-amazon.com/images/W/MEDIAX_792452-T1/images/I/81o283eJ9FL._SY466_.jpg",
  "isbn": "0062885456",
  "pagesCount": 352,
  "price": 355,
  "creationDate": {
    "$date": "2023-12-19T17:32:18.148Z"
  },
  "__v": 0
}]